---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.MepUpperTopElevationIncludeInsulation
source: html/9ecc3d7a-231e-a92b-436e-17e28ccbb7a3.htm
---
# Autodesk.Revit.DB.ParameterTypeId.MepUpperTopElevationIncludeInsulation Property

"Upper End Top of Insulation Elevation"

## Syntax (C#)
```csharp
public static ForgeTypeId MepUpperTopElevationIncludeInsulation { get; }
```